Sway-Light/sway-light-ht32f52352/main.c
/*********************************************************************************************************//**
 * @file    IP/Example/main.c
 * @version $Rev:: 4722         $
 * @date    $Date:: 2020-04-06 #$
 * @brief   Main program.
 *************************************************************************************************************
 * @attention
 *
 * Firmware Disclaimer Information
 *
 * 1. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, which is supplied by Holtek Semiconductor Inc., (hereinafter referred to as "HOLTEK") is the
 *    proprietary and confidential intellectual property of HOLTEK, and is protected by copyright law and
 *    other intellectual property laws.
 *
 * 2. The customer hereby acknowledges and agrees that the program technical documentation, including the
 *    code, is confidential information belonging to HOLTEK, and must not be disclosed to any third parties
 *    other than HOLTEK and the customer.
 *
 * 3. The program technical documentation, including the code, is provided "as is" and for customer reference
 *    only. After delivery by HOLTEK, the customer shall use the program technical documentation, including
 *    the code, at their own risk. HOLTEK disclaims any expressed, implied or statutory warranties, including
 *    the warranties of merchantability, satisfactory quality and fitness for a particular purpose.
 *
 * <h2><center>Copyright (C) Holtek Semiconductor Inc. All rights reserved</center></h2>
 ************************************************************************************************************/
// <<< Use Configuration Wizard in Context Menu >>>

/* Includes ------------------------------------------------------------------------------------------------*/
#include "ht32.h"
#include "ht32_board.h"

#include "arm_math.h"
#include "arm_const_structs.h"

#include "ws2812.h"
#include "DFPlayer.h"
#include "74HC4067.h"

#include "_ht32_project_source.h"

#include "time.h"

/** @addtogroup Project_Template Project Template
  * @{
  */

/** @addtogroup IP_Examples IP
  * @{
  */

/** @addtogroup Example
  * @{
  */

typedef union {
	struct {
		unsigned long Key1:  1;
		unsigned long Key2:  1;
		unsigned long Key3:  1;
		unsigned long Key4:  1;
		unsigned long Key5:  1;
		unsigned long Key6:  1;
		unsigned long Key7:  1;
		unsigned long Key8:  1;
		unsigned long Key9:  1;
		unsigned long Key10: 1;
		unsigned long Key11: 1;
		unsigned long Key12: 1;
		unsigned long Key13: 1;
		unsigned long Key14: 1;
		unsigned long Key15: 1;
		unsigned long Key16: 1;
	} Bit;
	u16 Data;
} TouchKey_TypeDef;

typedef enum {
	btRelease,
	btPressed
}BtStatus;
BtStatus mBtStatus = btRelease;

typedef enum {
	btNone,
	btClick,
	btLongClick
}BtAction;
BtAction mBtAction = btNone;

typedef struct {
	u32 year;
	u32 month;
	u32 day;
	u32 hour;
	u32 minute;
	u32 second;
} Time_T;

/* Settings ------------------------------------------------------------------------------------------------*/
void NVIC_Configuration(void);
void CKCU_Configuration(void);
void GPIO_Configuration(void);
void GPTM1_Configuration(void);
void I2C_Configuration(void);
void ADC_Configuration(void);
void TM_Configuration(void);
void espUART_Configuration(void);
void BFTM0_Configuration(void);

#if (ENABLE_CKOUT == 1)
void CKOUTConfig(void);
#endif

/* Private function prototypes -----------------------------------------------------------------------------*/
void ledInit(u8 offset);
void setLedOffset(uint8_t offset);
u32 Touchkey_ButtonRead(void);
void _I2C_Touchkey_AckPolling(void);
void get_TKLR(void);
void Slide(u32, u32, u8*);
void Zoom(u32, u32, u8*);
u8 *showRows(u8 Value);
void wsUpdateMag(void);
void ADC_MainRoutine(void);
void RUN_FFT(void);
void speakerEnable(bool enable);
void calculateGradient(u8 i1, u8 i2, u8 Fst_color[], u8 Snd_color[]);
void generateMusicColor(u8 level);
void DataToESP(u8 category, u8 type);
void DataFromESP(u8 command[]);
void SwitchingMode(u8 status);
void LightingMode(u8 type, u8 data[]);
void MusicMode(u8 type, u8 data[]);
void Setting(u8 syncType, u8 data[]);
static void delay(u32 count);

/* Global variables ----------------------------------------------------------------------------------------*/
/* Private types -------------------------------------------------------------------------------------------*/
// Switching Mode
u8 mode = 3;

// Lighting Mode
u8 L_Type;
u8 Brightness = 0, Color[3] = {0xFF, 0xFF, 0xFF};

// Music Mode
u8 M_Type, mLevel;
u8 high_color[3] = {255, 0, 0}, mid_color[3] = {255, 255, 0}, low_color[3] = {0, 255, 0};
u8 musicColor[WS_LEV_SIZE][3];

// Setting
struct tm ts;
u32 Timestamp = 0;
u8 sync, auto_OnOff[2] = {0, 0};
bool realTime_flag = FALSE;
struct tm AutoOn, AutoOff;
u8 weekdayEN[7];

// Touch key
const u8 zoom = 3, slide = 2, press = 1, none = 0;
typedef struct {
	u8 slide;
	u8 zoom;
	u8 offset;
} Z_O;
Z_O Light, Music;
u8 slideValue = 24, zoomValue = 4;
u8 status = none;
TouchKey_TypeDef Touch;
bool TK_CHECK = FALSE, TK_1SEC = FALSE;
u8 TK_L = 0, TK_R = 0;
u16 TK_COUNT = 0, adcIndex = 0;
s16 j = 0;

// WS2812B
u8 ws_white[3] = {255, 255, 255}, ws_clean[3] = {0, 0, 0};
u8 wsLevel[WS_FRQ_SIZE] = {1};
u8 wsLevelTM[WS_FRQ_SIZE] = {0};

// Touch key
#define I2C_TOUCHKEY_SPEED         (100000)          /*!< I2C speed                                          */
#define I2C_TOUCHKEY_DEV_ADDR      (0x50)           /*!< I2C device address                                 */
#define KEYSTATUS_CMD              (0x08)
bool touchKeyDelayFlag = FALSE;

// FFT
#define TEST_LENGTH_SAMPLES 128
bool sampleFlag = FALSE, startShow = FALSE, initFlag = FALSE;
s32 InputSignal[TEST_LENGTH_SAMPLES];
float32_t fftData[TEST_LENGTH_SAMPLES];
static float32_t OutputSignal[TEST_LENGTH_SAMPLES / 2];
uint32_t fftSize = TEST_LENGTH_SAMPLES / 2;
uint32_t ifftFlag = 0;
uint32_t doBitReverse = 1;

// ADC
s32 gADC_Result;
vu32 gADC_CycleEndOfConversion;

// LED
u16 WS_LED[WS_FRQ_SIZE][WS_LEV_SIZE];

// Button
bool btPress = FALSE;
bool btReleaseFlag = FALSE;
bool longClick = FALSE;
u32 btTM = 0;

