Sway-Light/sway-light-ht32f52352/main.c
	USART_InitStructure.USART_BaudRate = 9600;
	USART_InitStructure.USART_WordLength = USART_WORDLENGTH_8B;
	USART_InitStructure.USART_StopBits = USART_STOPBITS_1;
	USART_InitStructure.USART_Parity = USART_PARITY_NO;
	USART_InitStructure.USART_Mode = USART_MODE_NORMAL;
	USART_Init(HT_USART0, &USART_InitStructure);
	
	NVIC_EnableIRQ(USART0_IRQn);
	
	USART_IntConfig(HT_USART0, USART_INT_RXDR, ENABLE);
	
	USART_TxCmd(HT_USART0, ENABLE);
	USART_RxCmd(HT_USART0, ENABLE);
}

void BFTM0_Configuration(void) {
	{ /* Enable peripheral clock                                                                              */
		CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
		CKCUClock.Bit.BFTM0 = 1;
		CKCU_PeripClockConfig(CKCUClock, ENABLE);
	}
	
	/* BFTM as Repetitive mode, every 0.5 second to trigger the match interrupt                               */
	BFTM_SetCompare(HT_BFTM0, SystemCoreClock / 10);
	BFTM_SetCounter(HT_BFTM0, 0);
	BFTM_IntConfig(HT_BFTM0, ENABLE);
	BFTM_EnaCmd(HT_BFTM0, ENABLE);

	NVIC_EnableIRQ(BFTM0_IRQn);
}

#if (ENABLE_CKOUT == 1)
/*********************************************************************************************************//**
  * @brief  Configure the debug output clock.
  * @retval None
  ***********************************************************************************************************/
void CKOUTConfig(void) {
	CKCU_CKOUTInitTypeDef CKOUTInit;

	CKCU_PeripClockConfig_TypeDef CKCUClock = {{ 0 }};
	CKCUClock.Bit.AFIO = 1;
	CKCU_PeripClockConfig(CKCUClock, ENABLE);

	AFIO_GPxConfig(GPIO_PA, AFIO_PIN_9, AFIO_MODE_15);
	CKOUTInit.CKOUTSRC = CKCU_CKOUTSRC_HCLK_DIV16;
	CKCU_CKOUTConfig(&CKOUTInit);
}
#endif

#if (HT32_LIB_DEBUG == 1)
/*********************************************************************************************************//**
  * @brief  Report both the error name of the source file and the source line number.
  * @param  filename: pointer to the source file name.
  * @param  uline: error line source number.
  * @retval None
  ***********************************************************************************************************/
void assert_error(u8* filename, u32 uline) {
	/*
	 This function is called by IP library that the invalid parameters has been passed to the library API.
	 Debug message can be added here.
	 Example: printf("Parameter Error: file %s on line %d\r\n", filename, uline);
	*/

	while (1) {
	}
}
#endif

/* Private functions ---------------------------------------------------------------------------------------*/
void ledInit(u8 offset) {
	u8 i, j;
//j=0 {0,  19, 20, ...}
//j=1 {1,  18, 21, ...}
//
//j=9 {9,  10, 29, ...}
//     ^   ^   ^
//     i=0 i=1 i=2

	for (i = 0; i < WS_FRQ_SIZE; i++) {
		for(j = 0; j < WS_LEV_SIZE; j++) {
			u8 ref = i + offset;
			
			if (ref > WS_FRQ_SIZE - 1) ref -= WS_FRQ_SIZE;
			
			if (ref % 2 != 0) {
				WS_LED[i][j] = ref * WS_LEV_SIZE + ((WS_LEV_SIZE - 1) - j);
			}else {
				WS_LED[i][j] = ref * WS_LEV_SIZE + j;
			}
//			printf("%4d,", WS_LED[i][j]);
		}
//		printf("\r\n");
	}
	
	
}

void setLedOffset(uint8_t offset) {
	ledInit(offset);
}

u32 Touchkey_ButtonRead(void) {
	u32 uData;

	/* Touchkey addressread                                                                                   */
	_I2C_Touchkey_AckPolling();

	while (!I2C_CheckStatus(HT_I2C1, I2C_MASTER_TX_EMPTY));
	I2C_SendData(HT_I2C1, KEYSTATUS_CMD);

	/* Touchkey addressread                                                                                   */
	I2C_TargetAddressConfig(HT_I2C1, I2C_TOUCHKEY_DEV_ADDR, I2C_MASTER_READ);
	while (!I2C_CheckStatus(HT_I2C1, I2C_MASTER_RECEIVER_MODE));

	/* enable master receiver ACK                                                                             */
	I2C_AckCmd(HT_I2C1, ENABLE);

	/* sequential read                                                                                        */
	while (!I2C_CheckStatus(HT_I2C1, I2C_MASTER_RX_NOT_EMPTY));
	uData = I2C_ReceiveData(HT_I2C1);
	I2C_AckCmd(HT_I2C1, DISABLE);
	while (!I2C_CheckStatus(HT_I2C1, I2C_MASTER_RX_NOT_EMPTY));
	uData |= (I2C_ReceiveData(HT_I2C1) << 8);

	/* end of read                                                                                            */
	I2C_GenerateSTOP(HT_I2C1);

	return uData;
}

void _I2C_Touchkey_AckPolling(void) {
	u32 reg;
	/* wait if bus busy                                                                                       */
	while (I2C_GetFlagStatus(HT_I2C1, I2C_FLAG_BUSBUSY));

	/* send slave address until ack reply                                                                     */
	while (1) {
		/* send slave address                                                                                   */
		I2C_TargetAddressConfig(HT_I2C1, I2C_TOUCHKEY_DEV_ADDR, I2C_MASTER_WRITE);

		while (1) {
			reg = HT_I2C1->SR;
			if (reg & I2C_FLAG_ADRS) return;
			if (reg & I2C_FLAG_RXNACK) {
				I2C_ClearFlag(HT_I2C1, I2C_FLAG_RXNACK);
				break;
			}
		}
	}
}

void get_TKLR(void) {
	int index, check = 0x0001;
	
	for (index = 0; index < 16; index++) {
		if ((Touch.Data & check) == check) {
			TK_L = index;
			break;
		} else {
			check <<= 1;
		}
	}
	check = 0x8000;
	for (index = 15; index >= 0; index--) {
		if ((Touch.Data & check) == check) {
			TK_R = index;
			break;
		} else {
			check >>= 1;
		}
	}
}

void Slide(u32 L, u32 R, u8 *Value) {
	static u32 prevL = 0, prevR = 0;
	
	if (L != prevL || R != prevR) {
		if (L > prevL || R > prevR) {
			if (*Value <= 0) *Value = 0;
			else if (*Value < 50) (*Value) -= 2;
			else if (*Value >= 50) (*Value) -= 4;
		} else if (L < prevL || R < prevR) {
			if (*Value >= 100) *Value = 100;
			else if (*Value < 50) (*Value) += 2;
			else if (*Value >= 50) (*Value) += 4;
		}
		prevL = L;
		prevR = R;
	}
}

void Zoom(u32 L, u32 R, u8* Value) {
	static u32 prevL = 0, prevR = 0;
	
	if (L != prevL || R != prevR) {
		if (L > prevL || R < prevR) {
			if (*Value <= 6) *Value = 6;
			else (*Value) -= 1;
		} else if (L < prevL || R > prevR) {
			if (*Value >= WS_FRQ_SIZE) *Value = WS_FRQ_SIZE;
			else (*Value) += 1;
		}
		prevL = L;
		prevR = R;
	}
}

u8 *showRows(u8 Value) {
	u8 i;
	static u8 rows[WS_FRQ_SIZE] = {0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 1, 1, 1, 1, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0};
	u8 start_row, end_row;
	if (Value % 2 != 0) {
		start_row = WS_FRQ_SIZE / 2 - (Value / 2 + 1);
		end_row = WS_FRQ_SIZE / 2 + (Value / 2 - 1);
	} else if (Value % 2 == 0) {
		start_row = WS_FRQ_SIZE / 2 - Value / 2;
		end_row = WS_FRQ_SIZE / 2 + (Value / 2 - 1);
	}
	for (i = 0; i < WS_FRQ_SIZE; i++) {
		if (i >= start_row && i <= end_row) rows[i] = 1;
		else rows[i] = 0;
	}
//	printf("rows: ");
//	for (i = 0; i < WS_FRQ_SIZE; i++) printf("%2d ", rows[i]);
//	printf("\r\n");
	
	return rows;
}

