Sway-Light/sway-light-ht32f52352/main.c
		wsBlinkAll(10);
		wsShow();
		speakerEnable(FALSE);
		
		printf("Turn off\r\n");
	} else if (mode == 1) {
		mode = 3;
//		if (toEspFlag != TRUE) DataToESP(0x01, mode); // Sending Status Message
		adcIndex = 0;
		
		wsBlinkAll(10);
		wsShow();
		speakerEnable(TRUE);
		
		printf("Turn on\r\n");
	} else if (mode == 2 || mode == 3) {
		if (mode == 2) adcIndex = 0;
		wsUpdateMag();
		
		if (mode == 2) printf("Switch to Lighting Mode\r\n");
		else printf("Switch to Music Mode\r\n");
	}
}

void LightingMode(u8 type, u8 data[]) {
	u8 i;
	
	L_Type = type;
	if (L_Type == 0x01) {
		Brightness = data[0];
//		slideValue = Brightness;
		
		for (i = 0; i < 3; i++) Color[i] = data[i + 1];
		
	} else if (L_Type == 0x02) {
//		setLedOffset(data[0]);
	} else if (L_Type == 0x03) {
		zoomValue = data[0];
	} else if (L_Type == 0x05) {
		if (data[0] != Light.offset) {
			Light.offset = data[0];
			setLedOffset(Light.offset);
		}
		if (data[1] != Light.zoom) Light.zoom = data[1];
		if (data[2] != Light.slide) Light.slide = data[2];
	}
	wsUpdateMag();
}

void MusicMode(u8 type, u8 data[]) {
	u8 i;
	
	M_Type = type;
	mLevel = data[0];
	if (M_Type == 0x01) {
		for (i = 0; i < 3; i++) {
			if (mLevel == 0x01) high_color[i] = data[i + 1];
			else if (mLevel == 0x02) mid_color[i] = data[i + 1];
			else if (mLevel == 0x03) low_color[i] = data[i + 1];
		}
		
		generateMusicColor(mLevel);
	} else if (M_Type == 0x02) {
//		setLedOffset(data[0]);
	} else if (M_Type == 0x04) {
		
	} else if (M_Type == 0x05) {
		if (data[0] != Music.offset) {
			Music.offset = data[0];
			setLedOffset(Music.offset);
		}
		if (data[1] != Music.zoom) Music.zoom = data[1];
		if (data[2] != Music.slide) Music.slide = data[2];
	}
}

void Setting(u8 syncType, u8 data[]) {
	u8 i;
	u32 time = 0;
	
	sync = syncType;
					
	if (sync == 0xFF) {
		for (i = 0; i <= 3; i++) time += (data[3 - i] << (8 * i));
		Timestamp = time;
	}
	if (sync == 0x01 || sync == 0x00) {
		if (sync == 0x01) {
			auto_OnOff[0] = 1;
			AutoOn.tm_hour = data[1];
			AutoOn.tm_min = data[2];
			AutoOn.tm_sec = data[3];
			
			printf("Set Auto On => Days: %0X, %02d:%02d:%02d\r\n",
				data[0], 
				AutoOn.tm_hour, AutoOn.tm_min, AutoOn.tm_sec
			);
		} else if (sync == 0x00) {
			auto_OnOff[1] = 1;
			AutoOff.tm_hour = data[1];
			AutoOff.tm_min = data[2];
			AutoOff.tm_sec = data[3];
			
			printf("Set Auto Off => Days: %0X, %02d:%02d:%02d\r\n",
				data[0], 
				AutoOff.tm_hour, AutoOff.tm_min, AutoOff.tm_sec
			);
		}
		printf("Sun Sat Fri Thu Wed Tue Mon\r\n");
		for (i = 0; i < 7; i++) {
			weekdayEN[6 - i] = (data[0] >> i) & 0x01;
			printf("%3d ", weekdayEN[6 - i]);
		}
		printf("\r\n");
	}
	printf("Timestamp: %d sec\r\n", Timestamp);
}

static void delay(u32 count) {
	while (count--) {
		__NOP(); // Prevent delay loop be optimized
	}
}


/**
  * @}
  */

/**
  * @}
  */

/**
  * @}
  */
